apache/mynewt-core/hw/mcu/nordic/nrf51xxx/src/hal_timer.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <string.h>
#include <stdint.h>
#include <assert.h>
#include <errno.h>
#include "os/mynewt.h"
#include "mcu/cmsis_nvic.h"
#include "hal/hal_timer.h"
#include "nrf51.h"
#include "nrf51_bitfields.h"
#include "mcu/nrf51_hal.h"

/* IRQ prototype */
typedef void (*hal_timer_irq_handler_t)(void);

/*
 * We may need to use up to three output compares: one to read the counter,
 * one to generate the timer interrupt, and one to count overflows for a
 * 16-bit timer.
 */
#define NRF_TIMER_CC_OVERFLOW   (1)
#define NRF_TIMER_CC_READ       (2)
#define NRF_TIMER_CC_INT        (3)

/* Output compare 2 used for RTC timers */
#define NRF_RTC_TIMER_CC_INT    (2)

/* Maximum number of hal timers used */
#define NRF51_HAL_TIMER_MAX     (4)

/* Maximum timer frequency */
#define NRF51_MAX_TIMER_FREQ    (16000000)

/**
 * tmr_enabled: flag set if timer is enabled
 * tmr_irq_num: The irq number of this timer.
 * tmr_16bit: flag set if timer is set to 16-bit mode.
 * tmr_pad: padding.
 * tmr_cntr: Used for timers that are not 32 bits. Upper 16 bits contain
 *           current timer counter value; lower 16 bit come from hw timer.
 *  tmr_isrs: count of # of timer interrupts.
 *  tmr_freq: frequency of timer, in Hz.
 *  tmr_reg: Pointer to timer base address
 *  hal_timer_q: queue of linked list of software timers.
 */
struct nrf51_hal_timer {
    uint8_t tmr_enabled;
    uint8_t tmr_irq_num;
    uint8_t tmr_16bit;
    uint8_t tmr_rtc;
    uint32_t tmr_cntr;
    uint32_t timer_isrs;
    uint32_t tmr_freq;
    void *tmr_reg;
    TAILQ_HEAD(hal_timer_qhead, hal_timer) hal_timer_q;
};

#if MYNEWT_VAL(TIMER_0)
struct nrf51_hal_timer nrf51_hal_timer0;
#endif
#if MYNEWT_VAL(TIMER_1)
struct nrf51_hal_timer nrf51_hal_timer1;
#endif
#if MYNEWT_VAL(TIMER_2)
struct nrf51_hal_timer nrf51_hal_timer2;
#endif
#if MYNEWT_VAL(TIMER_3)
struct nrf51_hal_timer nrf51_hal_timer3;
#endif

struct nrf51_hal_timer *nrf51_hal_timers[NRF51_HAL_TIMER_MAX] = {
#if MYNEWT_VAL(TIMER_0)
    &nrf51_hal_timer0,
#else
    NULL,
#endif
#if MYNEWT_VAL(TIMER_1)
    &nrf51_hal_timer1,
#else
    NULL,
#endif
#if MYNEWT_VAL(TIMER_2)
    &nrf51_hal_timer2,
#else
    NULL,
#endif
#if MYNEWT_VAL(TIMER_3)
    &nrf51_hal_timer3,
#else
    NULL,
#endif
};

#define NRF51_TIMER_DEFINED     \
    (MYNEWT_VAL(TIMER_0) || MYNEWT_VAL(TIMER_1) || MYNEWT_VAL(TIMER_2) ||   \
     MYNEWT_VAL(TIMER_3))

/* Resolve timer number into timer structure */
#define NRF51_HAL_TIMER_RESOLVE(__n, __v)       \
    if ((__n) >= NRF51_HAL_TIMER_MAX) {         \
        rc = EINVAL;                            \
        goto err;                               \
    }                                           \
    (__v) = nrf51_hal_timers[(__n)];            \
    if ((__v) == NULL) {                        \
        rc = EINVAL;                            \
        goto err;                               \
    }

/* Interrupt mask for interrupt enable/clear */
#define NRF_TIMER_INT_MASK(x)    ((1 << (uint32_t)(x)) << 16)

static uint32_t
nrf_read_timer_cntr(NRF_TIMER_Type *hwtimer)
{
    uint32_t tcntr;

    /* Force a capture of the timer into 'cntr' capture channel; read it */
    hwtimer->TASKS_CAPTURE[NRF_TIMER_CC_READ] = 1;
    tcntr = hwtimer->CC[NRF_TIMER_CC_READ];

    return tcntr;
}

/**
 * nrf timer set ocmp
 *
 * Set the OCMP used by the timer to the desired expiration tick
 *
 * NOTE: Must be called with interrupts disabled.
 *
 * @param timer Pointer to timer.
 */
static void
nrf_timer_set_ocmp(struct nrf51_hal_timer *bsptimer, uint32_t expiry)
{
    int32_t delta_t;
    uint16_t expiry16;
    uint32_t cntr;
    uint32_t temp;
    NRF_TIMER_Type *hwtimer;
    NRF_RTC_Type *rtctimer;

    if (bsptimer->tmr_16bit) {
        /* Disable ocmp interrupt */
        hwtimer = (NRF_TIMER_Type *)bsptimer->tmr_reg;
        hwtimer->INTENCLR = NRF_TIMER_INT_MASK(NRF_TIMER_CC_INT);

        temp = expiry & 0xffff0000;
        delta_t = (int32_t)(temp - bsptimer->tmr_cntr);
        if (delta_t < 0) {
            goto set_ocmp_late;
        } else if (delta_t == 0) {
            /* Set ocmp and check if missed it */
            expiry16 = (uint16_t) expiry;
            hwtimer->CC[NRF_TIMER_CC_INT] = expiry16;

            /* Clear interrupt flag */
            hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_INT] = 0;

            /* Enable the output compare interrupt */
            hwtimer->INTENSET = NRF_TIMER_INT_MASK(NRF_TIMER_CC_INT);

            /* Force interrupt to occur as we may have missed it */
            if ((nrf_read_timer_cntr(hwtimer) >= expiry16) ||
                (hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_OVERFLOW])) {
                goto set_ocmp_late;
            }
        } else {
            /* Nothing to do; wait for overflow interrupt to set ocmp */
        }
    } else if (bsptimer->tmr_rtc) {
        rtctimer = (NRF_RTC_Type *)bsptimer->tmr_reg;
        rtctimer->INTENCLR = NRF_TIMER_INT_MASK(NRF_RTC_TIMER_CC_INT);
        temp = bsptimer->tmr_cntr;
        cntr = rtctimer->COUNTER;
        if (rtctimer->EVENTS_OVRFLW) {
            temp += (1UL << 24);
            cntr = rtctimer->COUNTER;
        }
        temp |= cntr;
        delta_t = (int32_t)(expiry - temp);

        /*
         * The nRF51xxx documentation states that COMPARE event is guaranteed
         * only if value written to CC register is at least 2 greater than the
         * current counter value. We also need to account for possible extra
         * tick during calculations so effectively any delta less than 3 needs
         * to be handled differently. TICK event is used to have interrupt on
         * each subsequent tick so we won't miss any and in case we detected
         * mentioned extra tick during calculations, interrupt is triggered
         * immediately. Delta 0 or less means we should always fire immediately.
         */
        if (delta_t < 1) {
            rtctimer->INTENCLR = RTC_INTENCLR_TICK_Msk;
            NVIC_SetPendingIRQ(bsptimer->tmr_irq_num);
        } else if (delta_t < 3) {
            rtctimer->INTENSET = RTC_INTENSET_TICK_Msk;
            if (rtctimer->COUNTER != cntr) {
                NVIC_SetPendingIRQ(bsptimer->tmr_irq_num);
            }
        } else {
            rtctimer->INTENCLR = RTC_INTENCLR_TICK_Msk;

