apache/mynewt-core/hw/mcu/nordic/nrf51xxx/src/hal_timer.c
            if (delta_t < (1UL << 24)) {
                rtctimer->CC[NRF_RTC_TIMER_CC_INT] = expiry & 0x00ffffff;
            } else {
                /* CC too far ahead. Just make sure we set compare far ahead */
                rtctimer->CC[NRF_RTC_TIMER_CC_INT] = cntr + (1UL << 23);
            }
            rtctimer->INTENSET = NRF_TIMER_INT_MASK(NRF_RTC_TIMER_CC_INT);
        }
    } else {
        /* Disable ocmp interrupt */
        hwtimer = (NRF_TIMER_Type *)bsptimer->tmr_reg;
        hwtimer->INTENCLR = NRF_TIMER_INT_MASK(NRF_TIMER_CC_INT);

        /* Set output compare register to timer expiration */
        hwtimer->CC[NRF_TIMER_CC_INT] = expiry;

        /* Clear interrupt flag */
        hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_INT] = 0;

        /* Enable the output compare interrupt */
        hwtimer->INTENSET = NRF_TIMER_INT_MASK(NRF_TIMER_CC_INT);

        /* Force interrupt to occur as we may have missed it */
        if ((int32_t)(nrf_read_timer_cntr(hwtimer) - expiry) >= 0) {
            goto set_ocmp_late;
        }
    }
    return;

set_ocmp_late:
    NVIC_SetPendingIRQ(bsptimer->tmr_irq_num);
}

/* Disable output compare used for timer */
static void
nrf_timer_disable_ocmp(NRF_TIMER_Type *hwtimer)
{
    hwtimer->INTENCLR = NRF_TIMER_INT_MASK(NRF_TIMER_CC_INT);
}

static void
nrf_rtc_disable_ocmp(NRF_RTC_Type *rtctimer)
{
    rtctimer->INTENCLR = NRF_TIMER_INT_MASK(NRF_RTC_TIMER_CC_INT);
    rtctimer->INTENCLR = RTC_INTENCLR_TICK_Msk;
}

static uint32_t
hal_timer_read_bsptimer(struct nrf51_hal_timer *bsptimer)
{
    uint16_t low;
    uint32_t low32;
    uint32_t ctx;
    uint32_t tcntr;
    NRF_TIMER_Type *hwtimer;
    NRF_RTC_Type *rtctimer;

    if (bsptimer->tmr_16bit) {
        hwtimer = (NRF_TIMER_Type *)bsptimer->tmr_reg;
        __HAL_DISABLE_INTERRUPTS(ctx);
        tcntr = bsptimer->tmr_cntr;
        low = nrf_read_timer_cntr(hwtimer);
        if (hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_OVERFLOW]) {
            tcntr += 65536;
            bsptimer->tmr_cntr = tcntr;
            low = nrf_read_timer_cntr(hwtimer);
            hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_OVERFLOW] = 0;
            NVIC_SetPendingIRQ(bsptimer->tmr_irq_num);
        }
        tcntr |= low;
        __HAL_ENABLE_INTERRUPTS(ctx);
    } else if (bsptimer->tmr_rtc) {
        rtctimer = (NRF_RTC_Type *)bsptimer->tmr_reg;
        __HAL_DISABLE_INTERRUPTS(ctx);
        tcntr = bsptimer->tmr_cntr;
        low32 = rtctimer->COUNTER;
        if (rtctimer->EVENTS_OVRFLW) {
            tcntr += (1UL << 24);
            bsptimer->tmr_cntr = tcntr;
            low32 = rtctimer->COUNTER;
            rtctimer->EVENTS_OVRFLW = 0;
            NVIC_SetPendingIRQ(bsptimer->tmr_irq_num);
        }
        tcntr |= low32;
        __HAL_ENABLE_INTERRUPTS(ctx);
    } else {
        /* Force a capture of the timer into 'cntr' capture channel; read it */
        tcntr = nrf_read_timer_cntr(bsptimer->tmr_reg);
    }

    return tcntr;
}

#if NRF51_TIMER_DEFINED
/**
 * hal timer chk queue
 *
 *
 * @param bsptimer
 */
static void
hal_timer_chk_queue(struct nrf51_hal_timer *bsptimer)
{
    uint32_t tcntr;
    uint32_t ctx;
    struct hal_timer *timer;

    /* disable interrupts */
    __HAL_DISABLE_INTERRUPTS(ctx);
    while ((timer = TAILQ_FIRST(&bsptimer->hal_timer_q)) != NULL) {
        if (bsptimer->tmr_16bit || bsptimer->tmr_rtc) {
            tcntr = hal_timer_read_bsptimer(bsptimer);
        } else {
            tcntr = nrf_read_timer_cntr(bsptimer->tmr_reg);
        }
        if ((int32_t)(tcntr - timer->expiry) >= 0) {
            TAILQ_REMOVE(&bsptimer->hal_timer_q, timer, link);
            timer->link.tqe_prev = NULL;
            timer->cb_func(timer->cb_arg);
        } else {
            break;
        }
    }

    /* Any timers left on queue? If so, we need to set OCMP */
    timer = TAILQ_FIRST(&bsptimer->hal_timer_q);
    if (timer) {
        nrf_timer_set_ocmp(bsptimer, timer->expiry);
    } else {
        if (bsptimer->tmr_rtc) {
            nrf_rtc_disable_ocmp((NRF_RTC_Type *)bsptimer->tmr_reg);
        } else {
            nrf_timer_disable_ocmp(bsptimer->tmr_reg);
        }
    }
    __HAL_ENABLE_INTERRUPTS(ctx);
}
#endif

/**
 * hal timer irq handler
 *
 * Generic HAL timer irq handler.
 *
 * @param tmr
 */
/**
 * hal timer irq handler
 *
 * This is the global timer interrupt routine.
 *
 */
#if (MYNEWT_VAL(TIMER_0) || MYNEWT_VAL(TIMER_1) || MYNEWT_VAL(TIMER_2))
static void
hal_timer_irq_handler(struct nrf51_hal_timer *bsptimer)
{
    uint32_t overflow;
    uint32_t compare;
    NRF_TIMER_Type *hwtimer;

    os_trace_isr_enter();

    /* Check interrupt source. If set, clear them */
    hwtimer = bsptimer->tmr_reg;
    compare = hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_INT];
    if (compare) {
        hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_INT] = 0;
    }

    if (bsptimer->tmr_16bit) {
        overflow = hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_OVERFLOW];
        if (overflow) {
            hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_OVERFLOW] = 0;
            bsptimer->tmr_cntr += 65536;
        }
    }


    /* Count # of timer isrs */
    ++bsptimer->timer_isrs;

    /*
     * NOTE: we dont check the 'compare' variable here due to how the timer
     * is implemented on this chip. There is no way to force an output
     * compare, so if we are late setting the output compare (i.e. the timer
     * counter is already passed the output compare value), we use the NVIC
     * to set a pending interrupt. This means that there will be no compare
     * flag set, so all we do is check to see if the compare interrupt is
     * enabled.
     */
    hal_timer_chk_queue(bsptimer);

    /* Recommended by nordic to make sure interrupts are cleared */
    compare = hwtimer->EVENTS_COMPARE[NRF_TIMER_CC_INT];

    os_trace_isr_exit();
}
#endif

#if MYNEWT_VAL(TIMER_3)
static void
hal_rtc_timer_irq_handler(struct nrf51_hal_timer *bsptimer)
{
    uint32_t overflow;
    uint32_t compare;
    uint32_t tick;
    NRF_RTC_Type *rtctimer;

